[{"url": "https://news.abs-cbn.com/entertainment/04/30/18/zion-gutierrez-turns-5", "image": ["https://sa.kapamilya.com/absnews/abscbnnews/media/2018/entertainment/05/30/zion-043018.jpg"], "summary": "On Sunday, Lahbati and Gutierrez posted photos of Zion on social media as they shared their birthday message to their firstborn.", "title": "Zion Gutierrez turns 5", "timestamp": "Apr 30 01:42 PM", "story": "MANILA -- Zion Gutierrez, the adorable son of Richard Gutierrez and Sarah Lahbati, has turned five. \nOn Sunday, Lahbati and Gutierrez posted photos of Zion on social media as they shared their birthday message to their firstborn. \n\n\n\n \n\nHappy birthday to my baby, Zion!!! I love you forever with all my heart. ❤️❤️❤️❤️❤️ #ziontheyounglion #zionturns5\nA post shared by  Sarah Lahbati (@sarahlahbati) on Apr 28, 2018 at 9:11pm PDT\n\n\n\n\n\n\n \n\nHappy 5th birthday little man! We Love you! 😊🙏🏼\nA post shared by  Richard Gutierrez (@richardgutz) on Apr 29, 2018 at 1:05pm PDT\n\n\nGutierrez and Lahbati introduced Zion to the public in 2014 after keeping him secret for more than a year.\nThe couple also have another son Kai, who was born just last March.", "video": [], "tags": ["Zion Gutierrez", "Richard Gutierrez", "Sarah Lahbati", "celebrity birthday"], "media": ["https://www.instagram.com/p/BiI_WEzAPzj/", "https://www.instagram.com/p/BiKsic7AcTK/"]}, {"url": "https://news.abs-cbn.com/entertainment/04/30/18/richard-poon-to-mark-10th-anniversary-with-concert", "image": ["https://sa.kapamilya.com/absnews/abscbnnews/media/2018/entertainment/05/30/richardpoon-yengconstantino-043018.jpg"], "summary": "Crooner Richard Poon is set to celebrate his 10th anniversary in the music industry with a special concert \"RP10,\" which will be held on May 18 at the Newport Performing Arts Theater of Resorts World Manila.", "title": "Richard Poon to mark 10th anniversary with concert", "timestamp": "Apr 30 01:40 PM", "story": "A post shared by Richard Poon (@richardpoonph) on Apr 10, 2018 at 9:26pm PDT\n\n\n\nMANILA -- Crooner Richard Poon is set to celebrate his 10th anniversary in the music industry with a special concert \"RP10,\" which will be held on May 18 at the Newport Performing Arts Theater of Resorts World Manila.\nPoon made the announcement on Monday on \"It's Showtime,\" where he opened the show with Yeng Constantino.\nJoining Poon's concert as guest artists are Richard Yap, Kean Cipriano, Sitti, Nyoy Volante, Erik Santos and Christian Bautista. He will be backed up by 21-man big band orchestra.\n\"RP10\" will be directed by John Prats.", "video": [], "tags": ["Richard Poon", "concert", "OPM", "music", "Resorts World Manila", "anniversary"], "media": ["https://www.instagram.com/p/Bhaq0zCHceX/"]}, {"url": "https://news.abs-cbn.com/entertainment/04/30/18/look-kristine-hermosa-shares-sweet-message-for-husband-oyo", "image": ["https://sa.kapamilya.com/absnews/abscbnnews/media/2018/entertainment/05/30/kristine-oyo-043018.jpg"], "summary": "Nearly three months after celebrating their seventh wedding anniversary, actress Kristine Hermosa once again reminded husband Oyo Sotto just how much she loves him.", "title": "LOOK: Kristine Hermosa shares sweet message for husband Oyo", "timestamp": "Apr 30 01:38 PM", "story": "MANILA -- Nearly three months after celebrating their seventh wedding anniversary, actress Kristine Hermosa once again reminded husband Oyo Sotto just how much she loves him.\nThe actress, who is in Siargao for the birthday celebration of her father-in-law Vic Sotto, turned sentimental as she pondered on marriage.\n\n\n\n \n\nA post shared by Kristine Hermosa-Sotto (@khsotto) on Apr 29, 2018 at 4:27pm PDT\n\n\n\"Every day we are given a chance to live our life choosing what matters the most. I choose God, I choose love. Today, I choose you once again... and that's how I want to live the rest of my days,\" she wrote as she thanked God for His \"unlimited love and grace.\" \nJust recently, Hermosa posted a quote also on marriage: \"A strong marriage requires two people who choose to love each other even on those days when they struggle to like each other.\"\nSotto and Hermosa tied the knot in Batangas on January 12, 2011. They have four children.", "video": [], "tags": ["Kristine Hermosa", "Oyo Sotto", "celebrity couple"], "media": ["https://www.instagram.com/p/BiLDuIdAdAt/"]}, {"url": "https://news.abs-cbn.com/entertainment/04/30/18/sino-nga-ba-si-luna-sa-buhay-ni-daniel-padilla", "image": ["https://sa.kapamilya.com/absnews/abscbnnews/media/2018/entertainment/05/30/daniel-padilla-043018.jpg"], "summary": "Sa \"Magandang Buhay\" nitong Lunes, ipinakilala ni Karla Estrada ang alaga ni Daniel na si Luna na limang buwan pa lamang.", "title": "Sino nga ba si 'Luna' sa buhay ni Daniel Padilla?", "timestamp": "Apr 30 01:35 PM", "story": "Watch more in iWantv or TFC.tv\nMANILA -- Nakakatuwa at nakakagigil na golden retriever ang isa sa mga alagang aso ni Daniel Padilla.\nSa \"Magandang Buhay\" nitong Lunes, ipinakilala ni Karla Estrada ang alaga ni Daniel na si Luna na limang buwan pa lamang. \nSa programa, kita ang pagiging masunurin ni Luna sa kanyang trainer.\n \n\"Alam mo ang tatalino ng mga golden retriever, grabe,\" ani Karla na tuwang-tuwa sa ipinakitang pagsunod ni Luna.\nBisitahin ang Patrol.PH para sa iba pang mga balita.", "video": ["//players.brightcove.net/1878978674001/rkebVmmV4_default/index.html?videoId=5778280222001"], "tags": ["Magandang Buhay", "Tagalog News", "celebrity pet", "Daniel Padilla", "dog"], "media": []}, {"url": "https://news.abs-cbn.com/entertainment/04/30/18/k-brosas-star-studded-ang-anniversary-concert", "image": ["https://sa.kapamilya.com/absnews/abscbnnews/media/2018/entertainment/05/30/reginevelasquez-kbrosas-043018.jpg"], "summary": "Hindi nagpakabog si K Brosas sa kanyang 18th anniversary concert na \"18K\" na naganap noong Sabado, Abril 28, sa Kia Theater.", "title": "K Brosas, star-studded ang anniversary concert", "timestamp": "Apr 30 01:19 PM", "story": "Watch more in iWantv or TFC.tv\nMANILA -- Hindi nagpakabog si K Brosas sa kanyang 18th anniversary concert na \"18K\" na naganap noong Sabado, Abril 28, sa Kia Theater.\n \nOpening number pa lang, pak at isang malaking check na kaagad ang isinalubong ng audience sa \"Gold\" at \"Run the World\" song-and-dance production number ni K. \nUnang bisita ang kanyang anak na si Crystal Brosas na ipinakitang may talento rin sa pagpe-perform. \nNext level din ang comedy segments kasama ang malalapit na kaibigan na sina Chocoleit at Pooh na napagkatuwaan ang K-Pop culture at generation sa Pilipinas.\nWinner din ang pagbirit ni K kasama sina Angeline Quinto at Kyla na gaya niya ay nagsimula rin sa amateur singing contest. \nNapanganga naman ang lahat sa kakaibang divas prod ni K kasama si Zsa Zsa Padilla, Jaya at Regine Velasquez sa buwis buhay na duet.\nKung may komedya, seryoso naman si K sa kanyang \"Warrior is A Child\" number na malapit sa puso niya. Dito ibinahagi ni K ang ilang personal na mga pinagdadaanan sa buhay at adbokasiya.\nIsang malaking pagbati kay K Brosas sa kanyang 18 taong makukulay at makahulugang showbiz career.\nBisitahin ang Patrol.PH para sa iba pang mga balita.", "video": ["//players.brightcove.net/1878978674001/rkebVmmV4_default/index.html?videoId=5778282146001"], "tags": ["Umagang Kay Ganda", "Tagalog News", "K Brosas", "concert"], "media": []}, {"url": "https://news.abs-cbn.com/entertainment/04/30/18/ex-pbb-housemates-gee-ann-mickey-expecting-baby-girl", "image": ["https://sa.kapamilya.com/absnews/abscbnnews/media/2018/entertainment/05/30/geeann-mickey-043018.jpg"], "summary": "Former \"Pinoy Big Brother\" housemates Mickey Perz and Gee-Ann Abrahan are expecting a baby girl.", "title": "Ex 'PBB' housemates Gee-Ann, Mickey expecting baby girl", "timestamp": "Apr 30 01:18 PM", "story": "MANILA -- Former \"Pinoy Big Brother\" housemates Mickey Perz and Gee-Ann Abrahan are expecting a baby girl.\nThe couple made the announcement during a gender-reveal party over the weekend in Quezon City.\nPhotos and video clips of the party, which was attended by the the couple's family and friends, have been uploaded on social media.\n\n\n\n \n\nA post shared by Saicy Aguila (@sexysaicy12) on Apr 29, 2018 at 4:19am PDT\n\n\n\nAbrahan, who confirmed her pregnancy just weeks ago, is expected to give birth this June. \nIn a previous interview, Abrahan said it took them a while to reveal that they are expecting a baby due to trauma after she suffered miscarriage in 2016.\n\"I had a miscarriage in the same year we got married in 2016. So since then, parang praning pa ako. Ayoko muna i-announce. Siguro ayun, kaya hindi niya pa rin sinasabi to our other friends so I won’t din muna,\" Abrahan said at the time.", "video": [], "tags": ["Gee-Ann Abrahan", "Mickey Perz", "celebrity baby", "gender reveal", "Pinoy Big Brother"], "media": ["https://www.instagram.com/p/BiJwYxqj9oC/"]}, {"url": "https://news.abs-cbn.com/entertainment/04/30/18/richard-gomez-lucy-torres-mark-20th-wedding-anniversary", "image": ["https://sa.kapamilya.com/absnews/abscbnnews/media/2018/entertainment/04/30/gomez.jpg"], "summary": "Celebrity couple Richard Gomez and Lucy Torres celebrated their 20th wedding anniversary last Saturday, April 28.", "title": "Richard Gomez, Lucy Torres mark 20th wedding anniversary", "timestamp": "Apr 30 11:46 AM", "story": "MANILA -- Celebrity couple Richard Gomez and Lucy Torres celebrated their 20th wedding anniversary last Saturday, April 28.\nThe couple shared their anniversary messages for each other on Instagram.\nTorres waxed sentimental as she shared a photo from 1998 while they were on their honeymoon in Switzerland.\n\n\n\n \n\nYou are my love song, @richardgomezinstagram.♥️ Cheers to 20 beautiful years, and more! 🥂♥️ 📷 circa 1998, young and in love, in a random photo booth while on honeymoon in Crans Montana, Switzerland. (P.S. I love you more today than yesterday, sweetheart.♥️🎶)\nA post shared by @ lucytgomez on Apr 28, 2018 at 5:28am PDT\n\n\n\n\"I love you more today than yesterday, sweetheart,\" Torres. \nFor his part, Gomez described his marriage with Torres as \"blissful.\"\n\n\n\n \n\n20 years of blissful marriage and I still kiss you like the first time I kissed you. #ohhkayanyoyan #tinatawananlangakonilucywhileimtypingthiscaption #hahahahahaha\nA post shared by  Richard Gomez 🇵🇭 (@richardgomezinstagram) on Apr 28, 2018 at 5:30am PDT\n\n\n\n\"I still kiss you like the first time I kissed you,\" Gomez wrote.\nGomez and Torres were married on April 28, 1998 in a grand wedding celebration that aired on ABS-CBN.\nThey have one child, Juliana.", "video": [], "tags": ["Richard Gomez", "Lucy Torres Gomez", "Lucy Torres", "wedding anniversary"], "media": ["https://www.instagram.com/p/BiHTe8Xjzuc/", "https://www.instagram.com/p/BiHTrXOndnp/"]}, {"url": "https://news.abs-cbn.com/entertainment/04/30/18/coleen-nawalan-ng-partner-sa-mismong-araw-ng-kasal", "image": ["https://sa.kapamilya.com/absnews/abscbnnews/media/2018/entertainment/04/30/coldog.jpg"], "summary": "Ibinahagi ni Coleen ang nararamdaman sa pagkawala ng kanyang mahal na alaga na regalo sa aktres para sa kanyang ikasiyam na kaarawan.", "title": "Coleen, nawalan ng 'partner' sa mismong araw ng kasal", "timestamp": "Apr 30 11:36 AM", "story": "MANILA -- Isang nakakaantig na kuwento ang ibinahagi ni Coleen Garcia sa pagpanaw ng kanyang alagang aso na si Bambi.\n\n\n\n \n\nA post shared by Coleen Garcia Crawford (@coleen) on Apr 29, 2018 at 3:40am PDT\n\n\n\nSa Instagram nitong Linggo, ibinahagi ni Coleen ang nararamdaman sa pagkawala ng kanyang mahal na alaga na regalo sa aktres para sa kanyang ikasiyam na kaarawan. \nAyon kay Coleen, itinuring niyang \"guardian angel\" si Bambi. \nAni Coleen, noon pa man ay hiniling niya sa kanyang alaga na huwag siyang iwan hanggang sa araw na siya ay ikasal.\n\"Way before I met (Billy Crawford), I’ve had several scares and thought I was going to lose her, but she proved to be the strongest little baby. I always told her, ever since I was a little girl, to never leave my side until the day I get married,\" ani Coleen.\nKuwento ni Coleen, mahina na si Bambi ilang araw bago ang kasal niya sa \"It's Showtime\" host na si Billy Crawford.\nNagpasalamat ang aktres sa alaga bago sabihing handa na siya kung sakaling iiwan na siya nito. \n\"On the night before we had to leave for the wedding, I saw how weak she was... It broke my heart. I hugged her and prayed to God, thanking Him for her life and companionship; for using her to remind me that I was never alone, and that someone was always watching over me. I thanked her, too, and I told her for the first time ever that it’s okay for her to rest now... I prayed to God that if it were to happen, I just hoped that it would happen while we weren’t home so that I wouldn’t have to see it,\" ani Coleen.\nSa araw mismo ng kanyang kasal, Abril 20, natanggap ni Coleen ang balitang pumanaw ang aso.\n\"On the morning of my wedding, April 20, 2018 at around 8:26 a.m., I woke up to a text from our driver, telling me that Bambi had passed away that same morning. How I felt was unexpected. I was purely filled with joy. I couldn’t even find it in me to be sad because I felt it would make me so greedy. How could I ask for more when God has blessed me with this much? She left me not a day before, not a day after, but waited until the actual DAY of my wedding. How amazing is that? All the tears I shed for Bambi now are never sad; only tears of joy and gratitude at the thought of God ushering me into this new chapter of my life, after all the turbulent times I have had to endure in the past. A clean slate, a new beginning,\" ani Coleen.\nBisitahin ang Patrol.PH para sa iba pang mga balita.", "video": [], "tags": ["Coleen Garcia", "Billy Crawford", "pet", "dog", "Tagalog news"], "media": ["https://www.instagram.com/p/BiJr22QgR3V/"]}, {"url": "https://news.abs-cbn.com/entertainment/04/30/18/avengers-opens-with-630-million-smashing-global-record", "image": ["https://sa.kapamilya.com/absnews/abscbnnews/media/2018/entertainment/04/29/042918-avengers.jpg", "https://sa.kapamilya.com/absnews/abscbnnews/media/2018/entertainment/04/29/042918-avengers.jpg"], "summary": "\"Avengers: Infinity War\" took in $630 million in its first weekend, the highest global opening of all time, industry estimates showed on Sunday.", "title": "'Avengers' opens with $630 million, smashing global record", "timestamp": "Apr 30 08:23 AM", "story": "A scene from 'Avengers: Infinity War'\n\n\nLOS ANGELES - \"Avengers: Infinity War\" took in $630 million in its first weekend, the highest global opening of all time, industry estimates showed on Sunday.\n\"The latest Marvel juggernaut... opened with $630M worldwide, making it the largest global weekend tally in the history of film, and this was done without China,\" which has a later opening, industry tracker Exhibitor Relations said.\nThat topped \"The Fate of the Furious,\" the eighth installment of the high-octane action series starring Vin Diesel, Dwayne Johnson and Michelle Rodriguez that opened with more than $530 million globally in 2017.\n\"Infinity War,\" which features more than two dozen superheroes fighting to save the universe, also broke the record for highest North American opening weekend, raking in $250 million at US and Canadian box offices.\n\nBox office: 'Avengers: Infinity War' closes in on all-time domestic weekend record\n\nThat beat \"The Force Awakens,\" the seventh film in the long-running \"Star Wars\" space saga that made $248 million in its opening weekend in 2015.\nSAVING THE UNIVERSE\n\"Infinity War\" is the 19th film in the so-called Marvel Cinematic Universe (MCU), combining a whopping 9 franchises and a cast list that reads like a who's who of Hollywood's A-list.\nRobert Downey Jr dons the red and gold metal suit once again as Iron Man; Benedict Cumberbatch is Doctor Strange; Scarlett Johansson is back as Black Widow; and Australia's Chris Hemsworth is Thor.\nAlso back for more?\nBlack Panther -- the Marvel breakout of the year after the standalone pic's massive opening in February -- Captain America, the Hulk, Spider-Man, Hawkeye, the Guardians of the Galaxy and their assorted allies.\nTheir mission is to prevent the powerful purple alien Thanos (Josh Brolin) from destroying the universe.\n\"We took a picture of every single person whose character has been in the MCU. We hung it up on a wall all around us,\" co-director Anthony Russo, who helms the film with his brother Joe, told reporters ahead of its release.\n\"We basically spent months and months and months talking about where we could go with each character, how we could draw them through the story,\" he added.\n\"Every one of these characters... has been on a very specific journey through the MCU to arrive at this moment.\"\nThis is the third \"Avengers\" film, before the final, untitled saga set for next year.\n'NORTH STAR'\nAn important source of inspiration is the Marvel canon -- the storylines developed over decades in the original comic books.\n\"Infinity War\" is drawn from the \"Infinity Gauntlet\" series of the early 1990s.\n\"It starts with those comics and us beginning to rip pages out or rip copies of pages out and put them on the walls and start to be inspired,\" explains Kevin Feige, the president of Marvel Studios, which is owned by Disney.\n\"It's a North Star for us as we lead these giant productions into reality.\"\nIn the movie's trailer, Gamora (Zoe Saldana) -- Thanos's daughter, of sorts -- explains that the villain believes that if he annihilates half of the universe, he can save the other half.\nHe needs the so-called Infinity Stones to do it. So, the heroes need to keep him from getting them.\nThe film cost an eye-watering $300 million to make, according to Hollywood media.\n\"It was about the most fun creative exercise I think I've ever been through in my life,\" said Anthony Russo. \"We thought about everybody in the MCU.\"", "video": [], "tags": ["film", "Avengers", "box office"], "media": []}, {"url": "https://news.abs-cbn.com/entertainment/multimedia/slideshow/04/30/18/in-photos-pilipinas-got-talent-grand-finals-night", "image": ["https://sa.kapamilya.com/absnews/abscbnnews/media/2018/entertainment/04/29/pgt11.jpg", "https://sa.kapamilya.com/absnews/abscbnnews/media/2018/entertainment/04/29/pgt1.jpg", "https://sa.kapamilya.com/absnews/abscbnnews/media/2018/entertainment/04/29/pgt2.jpg", "https://sa.kapamilya.com/absnews/abscbnnews/media/2018/entertainment/04/29/pgt3.jpg", "https://sa.kapamilya.com/absnews/abscbnnews/media/2018/entertainment/04/29/pgt4.jpg", "https://sa.kapamilya.com/absnews/abscbnnews/media/2018/entertainment/04/29/pgt5.jpg", "https://sa.kapamilya.com/absnews/abscbnnews/media/2018/entertainment/04/29/pgt6.jpg", "https://sa.kapamilya.com/absnews/abscbnnews/media/2018/entertainment/04/29/pgt7.jpg", "https://sa.kapamilya.com/absnews/abscbnnews/media/2018/entertainment/04/29/pgt8.jpg", "https://sa.kapamilya.com/absnews/abscbnnews/media/2018/entertainment/04/29/pgt9.jpg", "https://sa.kapamilya.com/absnews/abscbnnews/media/2018/entertainment/04/29/pgt10.jpg", "https://sa.kapamilya.com/absnews/abscbnnews/media/2018/entertainment/04/29/pgt11.jpg", "https://sa.kapamilya.com/absnews/abscbnnews/media/2018/entertainment/04/29/pgt12.jpg", "https://sa.kapamilya.com/absnews/abscbnnews/media/2018/entertainment/04/29/pgt13.jpg", "https://sa.kapamilya.com/absnews/abscbnnews/media/2018/entertainment/04/29/pgt14.jpg", "https://sa.kapamilya.com/absnews/abscbnnews/media/2018/entertainment/04/29/pgt15.jpg"], "summary": "The grand finals of the sixth season of of \"Pilipinas Got Talent\" was held at the Bren Z. Guiao Convention Center in San Fernando, Pampanga on Sunday, where spiral pole dancer Kristel de Catalina was named grand winner.", "title": "IN PHOTOS: 'Pilipinas Got Talent' grand finals night", "timestamp": "Apr 30 02:06 AM", "story": "", "video": [], "tags": ["Pilipinas Got Talent", "Pampanga", "Kristel de Catalina", "grand finals", "PGT"], "media": []}, {"url": "https://news.abs-cbn.com/video/entertainment/04/30/18/watch-moira-sings-nadarang-raps-for-the-1st-time-on-tv", "image": ["https://sa.kapamilya.com/absnews/abscbnnews/media/2018/entertainment/04/29/042918-moira.jpg"], "summary": "Singer Moira Dela Torre tried her hand at rapping, covering the hit song \"Nadarang.\"", "title": "WATCH: Moira sings 'Nadarang,' raps for the 1st time on TV", "timestamp": "Apr 30 01:51 AM", "story": "", "video": [], "tags": [], "media": []}, {"url": "https://news.abs-cbn.com/entertainment/04/30/18/watch-moira-boyfriend-compose-songs-using-random-words", "image": ["https://sa.kapamilya.com/absnews/abscbnnews/media/2018/entertainment/04/29/042918-moirabf.jpg"], "summary": "Singer Moira Dela Torre and her boyfriend, Jason Marvin, showed off their songwriting skills as they compose songs using random words.", "title": "WATCH: Moira, boyfriend compose songs using random words", "timestamp": "Apr 30 01:40 AM", "story": "Watch more in iWantv or TFC.tv\nSinger Moira Dela Torre and her boyfriend, Jason Marvin Hernandez, showed off their songwriting skills as they composed songs on the spot using random words.\nThe two were guests on \"Gandang Gabi Vice,\" where they were asked to sing songs using words like \"pechay,\" \"butiki,\" \"imburnal\" and \"kiti-kiti.\"\nComedian Vice Ganda also joined the fun, making up his own songs using the words \"kalabit\" and \"kalawang.\"\nBoth Dela Torre and Hernandez are singers and songwriters, and have shared their love for music through their various social media posts.", "video": ["//players.brightcove.net/1878978674001/rkebVmmV4_default/index.html?videoId=5778135210001"], "tags": ["Gandang Gabi Vice", "Moira Dela Torre", "Joseph Marvin", "Vice Ganda"], "media": []}, {"url": "https://news.abs-cbn.com/entertainment/04/30/18/moiras-new-music-video-holds-a-wonderful-surprise-for-fans", "image": ["https://sa.kapamilya.com/absnews/abscbnnews/media/2018/tvpatrol/04/28/moira.jpg"], "summary": "Moira Dela Torre on Sunday unveiled the music video for her single \"Tagpuan,\" and it ended with a surprise for her and her boyfriend's fans.", "title": "Moira's new music video holds a wonderful surprise for fans", "timestamp": "Apr 30 01:12 AM", "story": "Watch more in iWantv or TFC.tv\nMANILA -- Moira Dela Torre on Sunday unveiled the music video for her single \"Tagpuan,\" and it ended with a surprise for her and her boyfriend's fans.\nThe music video, directed by actor John Prats, was aired on \"Gandang Gabi Vice.\"\nDela Torre and Jason Marvin Hernandez also confirmed their engagement, as seen in the last part of the music video.\nAccording to Dela Torre, the video is a glimpse into her life's story.\n\"Buhay ko talaga. I come from a broken family, and we wanted to incorporate na just because you come from a broken family, doesn't mean your future's going to be broken also,\" she said.\nHowever, she admitted that the proposal was a surprise.\n\"That was the story pero hindi ko alam na doon pala siya magpo-propose,\" Dela Torre added.\nHernandez, for his part, said he talked with Prats and planned the proposal beforehand.\n\"Akala niya doon sa last part, magtatagpo lang kami. Pero hindi niya alam, nakikipagkuntsaba na ako kay Kuya John while planning the music video,\" he said.\nHe also took to social media to announce their engagement.\n\nAll my life I’ve been searching for “the one”, not knowing that she’s been my bestfriend all along. I love you forever my @moirarachelle4 🌚🌝❤️💍 pic.twitter.com/02kW5OjhgR\n— Jason Marvin (@jasonmarvinph) April 29, 2018", "video": ["https://www.youtube.com/embed/o3lohh-TVJA?enablejsapi=1"], "tags": ["Gandang Gabi Vice", "Moira Dela Torre", "Jason Marvin", "Tagpuan", "music video"], "media": []}, {"url": "https://news.abs-cbn.com/entertainment/04/30/18/box-office-avengers-infinity-war-closes-in-on-all-time-domestic-weekend-record", "image": ["https://sa.kapamilya.com/absnews/abscbnnews/media/2018/entertainment/04/29/042918-avengers.jpg", "https://sa.kapamilya.com/absnews/abscbnnews/media/2018/entertainment/04/29/042918-avengers.jpg"], "summary": "The Avengers assembled in full force at the box office this weekend.", "title": "Box office: 'Avengers: Infinity War' closes in on all-time domestic weekend record", "timestamp": "Apr 30 12:42 AM", "story": "A scene from 'Avengers: Infinity War'\n\n\nLOS ANGELES -- The Avengers assembled in full force at the box office this weekend.\n\"Avengers: Infinity War\" took North America by storm, opening with $250 million in 4,474 theaters. While numbers could fluctuate before an official tally comes in on Monday, that would surpass \"Star Wars: The Force Awakens\" for the biggest domestic opening weekend of all time. \"The Force Awakens\" bowed with $248 million in 2015.\nThe superhero tentpole, which cost between $300 million and $400 million, opened worldwide with $630 million, making it the highest global opening weekend of all time, even without China debuting this weekend.\nPrior to \"Infinity War,\" the original \"Avengers\" had the highest opening to date for a Marvel film, debuting with $207.4 million. Its sequel, \"Age of Ultron,\" launched with $191 million. The first movie earned $623 million in North America, while the second made $459 million.\nJoe and Anthony Russo directed from a script by Christopher Markus and Stephen McFeely. \"Infinity War\" picks up two years after the events of \"Captain America: Civil War\" with the Avengers teaming up with the Guardians of the Galaxy to stop the evil Thanos (Josh Brolin) from inter-galactic dominance.\nThe heroic ensemble cast includes Robert Downey Jr.'s Iron Man, Chris Hemsworth's Thor, Chris Evans' Captain America, Scarlett Johansson's Black Widow, Chadwick Boseman's Black Panther, Chris Pratt's Star Lord, Benedict Cumberbatch's Doctor Strange, and Mark Ruffalo's Hulk.\nWith no other films opening in the wake of \"Infinity War,\" Paramount Pictures' \"A Quiet Place\" secured second place with $10.6 million in 3,565 locations. The thriller -- directed by John Krasinski and co-starring Krasinski and Emily Blunt -- continues its impressive run with a domestic total of $148 million in four weeks. Due to the film's monster success, Paramount's head Jim Gianopulos announced a sequel was in the works.\nIn third place, STX's \"I Feel Pretty\" scored $8 million from 3,440 theaters in its second weekend. That brings the North American tally on Amy Schumer's latest comedy to $29 million. \nMeanwhile, Dwayne Johnson's \"Rampage\" dropped down to the fourth slot, earning $7.1 million in 3,508 locations. The Warner Bros. actioner has made $77.9 million domestically in its three weeks of release.\nRounding out the weekend is another Marvel title, \"Black Panther.\" In its 11th weekend, the tentpole made $4.6 million, bringing its domestic total to $688 million. Globally, \"Black Panther\" has collected $1.3 billion. With \"Infinity War's\" massive debut, Marvel's 19 titles have collectively grossed $15 billion worldwide.\n\"Infinity War\" has ignited a spark in the box office. Prior to this weekend, the year to date box office was down 2.8 percent. After this weekend, the 2018 box office is up 3.2 percent compared to 2017, according to comScore.\n\"'Avengers: Infinity War' demonstrated yet another Marvel superhero power,\" Paul Dergarabedian, an analyst at comScore, said. \"The ability to reverse a downtrending box office year with a single knockout punch and literally change the box office fortunes of Hollywood almost overnight.\"", "video": [], "tags": ["Avengers: Infinity War", "box office", "Hollywood"], "media": []}, {"url": "https://news.abs-cbn.com/entertainment/04/29/18/i-can-see-your-voice-kim-chiu-fails-in-picking-mr-right", "image": ["https://sa.kapamilya.com/absnews/abscbnnews/media/2018/tvpatrol/04/28/kim.jpg"], "summary": "Actress Kim Chiu failed to pick the right contestant when she tried her luck on Sunday's episode of \"I Can See Your Voice.\"", "title": "'I Can See Your Voice': Kim Chiu fails in picking 'Mr. Right'", "timestamp": "Apr 29 11:32 PM", "story": "Actress Kim Chiu failed to pick the right contestant when she tried her luck on Sunday's episode of \"I Can See Your Voice.\"\nChiu eliminated a total of four secret singers, one in the first round, another in the second round and two more in the last round.\nShe ended up picking Dyvez Eltanal, who was revealed to be anything but a singer.\n\nWatch more in iWantv or TFC.tv\nBased on the Korean show of the same title, \"I Can See Your Voice\" airs Saturdays after \"Maalaala Mo Kaya\" and Sundays after \"Rated K.\"", "video": ["//players.brightcove.net/1878978674001/rkebVmmV4_default/index.html?videoId=5778115796001"], "tags": ["I Can See Your Voice", "Kim Chiu"], "media": []}]